; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v2 - type_3 ?v6 - type_1)
 	      (pred_4 ?v3 - object ?v6 - type_1)
	      (pred_3 ?v2 - type_3 ?v1 - type_2)
	      (pred_1 ?v2 - type_3 ?v3 - object ?v1 - type_2))

   (:action op_2
       :parameters  (?v2 - type_3 ?v8 ?v7 - type_1)
       :precondition (and  (pred_2 ?v2 ?v8))
       :effect (and  (pred_2 ?v2 ?v7)
		     (not (pred_2 ?v2 ?v8))))

   (:action op_1
       :parameters (?v2 - type_3 ?v4 - object ?v5 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_4 ?v4 ?v5) (pred_2 ?v2 ?v5) (pred_3 ?v2 ?v1))
       :effect (and (pred_1 ?v2 ?v4 ?v1)
		    (not (pred_4 ?v4 ?v5)) 
		    (not (pred_3 ?v2 ?v1))))

   (:action op_3
       :parameters (?v2 - type_3 ?v4 - object ?v5 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v2 ?v4 ?v1) (pred_2 ?v2 ?v5))
       :effect (and (pred_4 ?v4 ?v5)
		    (pred_3 ?v2 ?v1)
		    (not (pred_1 ?v2 ?v4 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_08 obj_10 - type_3
obj_13 obj_02 obj_01 obj_07 - type_2
obj_05 obj_11 obj_12 obj_03 - type_1
obj_06 obj_04 obj_09 - object)
(:init
(pred_2 obj_08 obj_12)
(pred_3 obj_08 obj_13)
(pred_3 obj_08 obj_02)
(pred_2 obj_10 obj_05)
(pred_3 obj_10 obj_01)
(pred_3 obj_10 obj_07)
(pred_4 obj_06 obj_05)
(pred_4 obj_04 obj_12)
(pred_4 obj_09 obj_03)
)
(:goal
(and
(pred_4 obj_06 obj_05)
(pred_4 obj_04 obj_11)
(pred_4 obj_09 obj_11)
)
)

(:constraints
  (always (not (pred_2 obj_08 obj_03)))
)
)

; plan
1. (op_1 obj_08 obj_04 obj_12 obj_02)
   deleted: (pred_4 obj_04 obj_12) (pred_3 obj_08 obj_02)
   added: (pred_1 obj_08 obj_04 obj_02)
   goals met: 1 of 3
2. (op_2 obj_10 obj_05 obj_03)
   deleted: (pred_2 obj_10 obj_05)
   added: (pred_2 obj_10 obj_03)
   goals met: 1 of 3
3. (op_2 obj_08 obj_12 obj_11)
   deleted: (pred_2 obj_08 obj_12)
   added: (pred_2 obj_08 obj_11)
   goals met: 1 of 3
4. (op_1 obj_10 obj_09 obj_03 obj_07)
   deleted: (pred_4 obj_09 obj_03) (pred_3 obj_10 obj_07)
   added: (pred_1 obj_10 obj_09 obj_07)
   goals met: 1 of 3
5. (op_2 obj_10 obj_03 obj_11)
   deleted: (pred_2 obj_10 obj_03)
   added: (pred_2 obj_10 obj_11)
   goals met: 1 of 3
6. (op_3 obj_08 obj_04 obj_11 obj_02)
   deleted: (pred_1 obj_08 obj_04 obj_02)
   added: (pred_4 obj_04 obj_11) (pred_3 obj_08 obj_02)
   goals met: 2 of 3
7. (op_3 obj_10 obj_09 obj_11 obj_07)
   deleted: (pred_1 obj_10 obj_09 obj_07)
   added: (pred_4 obj_09 obj_11) (pred_3 obj_10 obj_07)
   goals met: 3 of 3
